In [1]:
import os

In [2]:
pwd

'C:\\Users\\Administrator\\Desktop\\prods_2406'

In [3]:
# os.chdir('')

In [4]:
# 시험에서 사용되는 패키지 종류
# 주석 처리: Ctrl + /

import pandas as pd
import numpy as np

# import scipy as sc
# import sklearn as sk
# import statsmodels

In [5]:
pd.__version__

'2.2.2'

In [ ]:
# !pip install pandas

In [ ]:
# !pip install numpy

In [32]:
df_f = pd.DataFrame(dict(v1=[100, 200, 300],
                         v2=[400,500,600],
                         v3=['A','B','C']))
df_f

    v1   v2 v3
0  100  400  A
1  200  500  B
2  300  600  C

In [7]:
df_f.shape  # 행, 열 확인

(3, 3)

In [8]:
df_f.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   v1      3 non-null      int64
 1   v2      3 non-null      int64
 2   v3      3 non-null      object
dtypes: int64(2), object(1)
memory usage: 204.0+ bytes

In [9]:
df_f.dtypes

v1     int64
v2     int64
v3    object
dtype: object

In [10]:
df_f['v1']

0    100
1    200
2    300
Name: v1, dtype: int64

In [13]:
df_f[0:2]  # : 사용시 행이름으로 사용해야 함

    v1   v2 v3
0  100  400  A
1  200  500  B

In [14]:
# df_f.loc[행, 열]

df_f.loc[0:2, 'v1':'v2']  # 이름 방식으로 접근, 연속 복수명 사용 시 : 콜론(:), 비연속 복수명 사용 시: 리스트[]

    v1   v2
0  100  400
1  200  500
2  300  600

In [16]:
df_f.iloc[0:2, 0:2] # 위치번호로 접근

    v1   v2
0  100  400
1  200  500

In [17]:
df_s=df_f.copy()
df_s

    v1   v2 v3
0  100  400  A
1  200  500  B
2  300  600  C

In [18]:
df_f.columns

Index(['v1', 'v2', 'v3'], dtype='object')

In [19]:
df_f.index

RangeIndex(start=0, stop=3, step=1)

In [21]:
df_f.index=['a','b','c']
df_f.index

Index(['a', 'b', 'c'], dtype='object')

In [22]:
df_f

    v1   v2 v3
a  100  400  A
b  200  500  B
c  300  600  C

In [23]:
df_f.loc['a':'c', 'v1':'v2']

    v1   v2
a  100  400
b  200  500
c  300  600

In [24]:
df_f.iloc[0:2, 0:2]

    v1   v2
a  100  400
b  200  500

In [25]:
df_f=df_f.rename(index={'b':'d'})

In [26]:
df_f

    v1   v2 v3
a  100  400  A
d  200  500  B
c  300  600  C

In [27]:
df_f.v1  # columns명이 문자열로 지정되어 있을 경우 사용->Series

a    100
d    200
c    300
Name: v1, dtype: int64

In [28]:
df_f['v1'] # columns명이 숫자/문자열로 사용 -> Series

a    100
d    200
c    300
Name: v1, dtype: int64

In [29]:
df_f[['v1']] # columns명이 숫자/문자열로 사용 -> DataFrame

    v1
a  100
d  200
c  300

# 조건 및 필터링

- 명령모드에서 M : Markdown, Y: code

- DataFrame은 조건 및 필터링 결과를 활용할 시 기본적으로 동일 인덱스를 찾아서 필터링
- DataFrame과 Series는 인덱스명에 제약 받음

In [30]:
# df_f[조건]   # array: 조건의 결과가 True, False 결과가 있는 위치를 그대로 적용, 
# Series:조건의 결과가 True, False 결과가 있는 인덱스명과 동일한 인덱스명의 값을 조회해서 찾아옴

In [33]:
df_f['v1'] == 200

0    False
1     True
2    False
Name: v1, dtype: bool

In [35]:
# df_s=df_f.copy()

In [36]:
df_s['v1'] == 200

0    False
1     True
2    False
Name: v1, dtype: bool

In [37]:
df_f.index=['a','b','c']

In [38]:
df_f['v1'] == 200

a    False
b     True
c    False
Name: v1, dtype: bool

In [39]:
df_f[df_f['v1'] == 200]

    v1   v2 v3
b  200  500  B

In [41]:
(df_f['v1'] == 200).values

array([False,  True, False])

In [42]:
df_s[(df_f['v1'] == 200).values]

    v1   v2 v3
1  200  500  B

In [44]:
df_f=df_f.reset_index(drop=True)  # 기존 인덱스를 새로운 열에 추가하지 않고 삭제 후 인덱스 새로 생성
# df_f.reset_index(drop=True, inplace=True) # 추천하지 않음

    v1   v2 v3
0  100  400  A
1  200  500  B
2  300  600  C

In [45]:
# 같다 ==
# 같지 않다 !=
# 크거나 같다(이상) >=
# 크다 >
# 작거나 같다(이하) <=
# 작다 <
# not(반대) ~

df_s.v1 != 100

0    False
1     True
2     True
Name: v1, dtype: bool

In [46]:
df_s[df_s.v1 != 100]

    v1   v2 v3
1  200  500  B
2  300  600  C

In [47]:
df_s[df_s.v1 >= 100]

    v1   v2 v3
0  100  400  A
1  200  500  B
2  300  600  C

In [48]:
df_s[~(df_s.v1 == 100)]

    v1   v2 v3
1  200  500  B
2  300  600  C

In [50]:
(df_s.v3 == 'A')

0     True
1    False
2    False
Name: v3, dtype: bool

In [51]:
(df_s.v3 == 'C')

0    False
1    False
2     True
Name: v3, dtype: bool

In [52]:
# &(동시 만족되면 True), |(또는 중에 조건이 만족되면 True) : 벡터로 리턴
# [비교] &&, || : 스칼라, 상수
(df_s.v3 == 'A') | (df_s.v3 == 'C')

0     True
1    False
2     True
Name: v3, dtype: bool

In [53]:
cond1=(df_s.v3 == 'A')
cond2=(df_s.v3 == 'C')

df_s[cond1 | cond2]

    v1   v2 v3
0  100  400  A
2  300  600  C

In [54]:
# df_s.v3.isin(리스트 목록 나열), 리스트 목록에 해당하는 것만 True 리턴

df_s.v3.isin(['A','C'])

0     True
1    False
2     True
Name: v3, dtype: bool

In [58]:
# 데이터 타입이 문자열이 열 목록 추출

obj_list=df_s.columns[df_s.dtypes == 'object']
obj_list

Index(['v3'], dtype='object')

In [59]:
df_s[df_s.v1 == 100][obj_list]

  v3
0  A

In [60]:
df_s.loc[df_s.v1 == 100, obj_list]

  v3
0  A

In [61]:
pwd

'C:\\Users\\Administrator\\Desktop\\prods_2406'

In [63]:
# import os
# os.listdir('.')

In [ ]:
# os.chdir('C:/.../data')

In [64]:
df=pd.read_csv('./data/krx_202105_utf8.csv')
df.head(3)

,지수명,종가,대비,등락률,시가,고가,저가,거래량,거래대금,상장시가총액,날짜
0,KRX 300,1901.05,-11.63,-0.61,1913.15,1929.94,1896.65,279548840,13488481375036,2028800954161500,20210503
1,KTOP 30,11520.28,-86.30,-0.74,11609.44,11702.14,11490.84,50048566,5645660149606,1208343758559140,20210503
2,KRX 100,6624.66,-29.51,-0.44,6656.43,6722.06,6607.57,125958178,9134221260606,1698357633429640,20210503

In [65]:
df[df['종가']==df['종가'].max()]

,지수명,종가,대비,등락률,시가,고가,저가,거래량,거래대금,상장시가총액,날짜
117,KTOP 30,11869.29,135.96,1.16,11753.02,11913.62,11753.02,52051112,5414226520140,1241838527633600,20210510

In [66]:
df[df['종가']==df['종가'].max()][['시가','고가',	'저가','거래량']]

           시가        고가        저가       거래량
117  11753.02  11913.62  11753.02  52051112

In [67]:
df.loc[df['종가']==df['종가'].max(), ['시가','고가',	'저가','거래량']]

           시가        고가        저가       거래량
117  11753.02  11913.62  11753.02  52051112

In [ ]:
# df['종가'].max()  # 최대값
# df['종가'].idxmax()  # 최대값이 있는 첫번째 위치 번호(인덱스명) 리턴
# df['종가'].min()
# df['종가'].idxmin()
# df['종가'].nlargest(k)  # 상위 k개의 목록
# df['종가'].nsallest(k) #  하위 k개의 목록

In [69]:
df['종가'].idxmax()  # 최대값이 있는 첫번째 위치 번호 리턴

117

In [76]:
df.iloc[:,1:-1].corr()['종가'].drop('종가').abs().idxmax()

'저가'

# 결측치 처리

In [ ]:
# .isna() # nan, 결측치 등록: np.nan
# .dropna(subset=['열이름 지정'], axis=0/1)  # 지정한 열만을 기준으로 결측치 처리 
# .fillna({'v1':3, 'v2':5})  # 결측치를 지정한 값으로 교체
# .all() : 모든 값이 True 일 때 True 리턴, 나머지는 False
# .any() : 적어도 하나가 True 일 때 True 리턴, 나머지는 False

In [77]:
df=pd.read_csv('./data/iris_missing.csv')
df.head()

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          NaN           NaN          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [79]:
# 결측치 위치 데이터 필터링

df[df['Sepal.Width'].isna()]

     Sepal.Length  Sepal.Width  Petal.Length  Petal.Width     Species
0             5.1          NaN           NaN          0.2      setosa
6             NaN          NaN           NaN          NaN      setosa
12            4.8          NaN           1.4          0.1      setosa
34            NaN          NaN           1.5          0.2      setosa
39            5.1          NaN           NaN          0.2      setosa
53            5.5          NaN           4.0          1.3  versicolor
87            6.3          NaN           4.4          NaN  versicolor
98            5.1          NaN           3.0          1.1  versicolor
103           6.3          NaN           NaN          1.8   virginica
111           NaN          NaN           NaN          NaN   virginica
122           7.7          NaN           6.7          2.0   virginica
129           7.2          NaN           5.8          1.6   virginica
139           6.9          NaN           NaN          2.1   virginica

In [82]:
# 결측치 제거

df_drop=df.dropna(subset=['Sepal.Width'])
df_drop[:10]

    Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
1            4.9          3.0           1.4          0.2  setosa
2            4.7          3.2           1.3          0.2  setosa
3            4.6          3.1           1.5          0.2  setosa
4            5.0          3.6           1.4          0.2  setosa
5            5.4          3.9           1.7          0.4  setosa
7            5.0          3.4           NaN          0.2  setosa
8            4.4          2.9           1.4          0.2  setosa
9            4.9          3.1           NaN          0.1  setosa
10           5.4          3.7           NaN          0.2  setosa
11           4.8          3.4           1.6          0.2  setosa

In [85]:
df.drop(columns='Species').mean()

Sepal.Length    5.853846
Sepal.Width     3.070073
Petal.Length    3.811765
Petal.Width     1.190972
dtype: float64

In [86]:
# 결측치 보정

df_fill=df.fillna(df.drop(columns='Species').mean())

In [88]:
df.head()

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          NaN           NaN          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [87]:
df_fill.head()

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1     3.070073      3.811765          0.2  setosa
1           4.9     3.000000      1.400000          0.2  setosa
2           4.7     3.200000      1.300000          0.2  setosa
3           4.6     3.100000      1.500000          0.2  setosa
4           5.0     3.600000      1.400000          0.2  setosa

In [89]:
df.head()

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          NaN           NaN          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [90]:
df_f=df.copy()

In [91]:
df_f['shift1'] = df_f['Sepal.Width'].shift(1)   # shift(양수(아래)/음수(위로))
df_f['shift2'] = df_f['Sepal.Width'].shift(2)
df_f['shiftinv1'] = df_f['Sepal.Width'].shift(-1)
df_f.head()

,Sepal.Length,Sepal.Width,Petal.Length,Petal.Width,Species,shift1,shift2,shiftinv1
0,5.1,NaN,NaN,0.2,setosa,NaN,NaN,3.0
1,4.9,3.0,1.4,0.2,setosa,NaN,NaN,3.2
2,4.7,3.2,1.3,0.2,setosa,3.0,NaN,3.1
3,4.6,3.1,1.5,0.2,setosa,3.2,3.0,3.6
4,5.0,3.6,1.4,0.2,setosa,3.1,3.2,3.9

In [93]:
(df_f['Sepal.Width'].interpolate()).isna().sum()

1

# 문자열, 시간, 집계

In [94]:
df['Species'].str.split('e')  # 글자 분리

0        [s, tosa]
1        [s, tosa]
2        [s, tosa]
3        [s, tosa]
4        [s, tosa]
          ...
145    [virginica]
146    [virginica]
147    [virginica]
148    [virginica]
149    [virginica]
Name: Species, Length: 150, dtype: object

In [98]:
# help(df['Species'].str.slice)
df['Species'].str.slice(0,3)  # 글자 추출

0      set
1      set
2      set
3      set
4      set
      ...
145    vir
146    vir
147    vir
148    vir
149    vir
Name: Species, Length: 150, dtype: object

In [ ]:
df['Species'].str.strip()  # 앞뒤 스페이스 제거

In [ ]:
df['Species'].str.contains('se|vi') # se와 vi 글자가 포함된 셀을 True로 리턴

In [99]:
# df['Species'].str.contains('[se]', regex=True) # s 또는 e가 포함된 글자를 찾아주세요

0      True
1      True
2      True
3      True
4      True
       ...
145    True
146    True
147    True
148    True
149    True
Name: Species, Length: 150, dtype: bool

In [100]:
df=pd.read_csv('./data/bike.csv')
df.head()

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40
2,2011-01-01 02:00:00,1,0,0,1,9.02,13.635,80,0.0,5,27,32
3,2011-01-01 03:00:00,1,0,0,1,9.84,14.395,75,0.0,3,10,13
4,2011-01-01 04:00:00,1,0,0,1,9.84,14.395,75,0.0,0,1,1

In [101]:
df.dtypes

datetime       object
season          int64
holiday         int64
workingday      int64
weather         int64
temp          float64
atemp         float64
humidity        int64
windspeed     float64
casual          int64
registered      int64
count           int64
dtype: object

In [102]:
# pd.to_datetime( format='%Y 년 %m 월 %d 일' ) # 데이터 타입을 날짜로 변경

df['datetime2']=pd.to_datetime(df['datetime'])
df.dtypes

datetime              object
season                 int64
holiday                int64
workingday             int64
weather                int64
temp                 float64
atemp                float64
humidity               int64
windspeed            float64
casual                 int64
registered             int64
count                  int64
datetime2     datetime64[ns]
dtype: object

In [103]:
df.head()

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count,datetime2
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16,2011-01-01 00:00:00
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40,2011-01-01 01:00:00
2,2011-01-01 02:00:00,1,0,0,1,9.02,13.635,80,0.0,5,27,32,2011-01-01 02:00:00
3,2011-01-01 03:00:00,1,0,0,1,9.84,14.395,75,0.0,3,10,13,2011-01-01 03:00:00
4,2011-01-01 04:00:00,1,0,0,1,9.84,14.395,75,0.0,0,1,1,2011-01-01 04:00:00

In [104]:
df.datetime2.dt.year

0        2011
1        2011
2        2011
3        2011
4        2011
         ...
10881    2012
10882    2012
10883    2012
10884    2012
10885    2012
Name: datetime2, Length: 10886, dtype: int32

In [105]:
df.datetime2.dt.month

0         1
1         1
2         1
3         1
4         1
         ..
10881    12
10882    12
10883    12
10884    12
10885    12
Name: datetime2, Length: 10886, dtype: int32

In [106]:
df.datetime2.dt.day

0         1
1         1
2         1
3         1
4         1
         ..
10881    19
10882    19
10883    19
10884    19
10885    19
Name: datetime2, Length: 10886, dtype: int32

In [107]:
df.datetime2.dt.date

0        2011-01-01
1        2011-01-01
2        2011-01-01
3        2011-01-01
4        2011-01-01
            ...
10881    2012-12-19
10882    2012-12-19
10883    2012-12-19
10884    2012-12-19
10885    2012-12-19
Name: datetime2, Length: 10886, dtype: object

In [109]:
df.datetime2.dt.day_of_week

0        5
1        5
2        5
3        5
4        5
        ..
10881    2
10882    2
10883    2
10884    2
10885    2
Name: datetime2, Length: 10886, dtype: int32

In [110]:
df.datetime2.dt.day_name()

0         Saturday
1         Saturday
2         Saturday
3         Saturday
4         Saturday
           ...
10881    Wednesday
10882    Wednesday
10883    Wednesday
10884    Wednesday
10885    Wednesday
Name: datetime2, Length: 10886, dtype: object

In [113]:
df.datetime2.dt.strftime('%A')

0         Saturday
1         Saturday
2         Saturday
3         Saturday
4         Saturday
           ...
10881    Wednesday
10882    Wednesday
10883    Wednesday
10884    Wednesday
10885    Wednesday
Name: datetime2, Length: 10886, dtype: object

In [ ]:
# 집계

# len() # 길이
# .unique()  # 중복 제거 후 원소들만 리턴, array
# .nunique()  # 원소의 수 리턴
# .drop_duplicates() # 중복 제거 후 원소들만 리턴, series
# .value_counts(normalize=True) # 빈도/확률 리턴
# .crosstab() # 교차 빈도/확률/통계량
# .pivot_table() ## 교차 빈도/통계량

In [115]:
df.head(3)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count,datetime2
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16,2011-01-01 00:00:00
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40,2011-01-01 01:00:00
2,2011-01-01 02:00:00,1,0,0,1,9.02,13.635,80,0.0,5,27,32,2011-01-01 02:00:00

In [116]:
len(df)

10886

In [118]:
df.season.unique()

array([1, 2, 3, 4], dtype=int64)

In [119]:
df.season.drop_duplicates()

0       1
1323    2
2690    3
4055    4
Name: season, dtype: int64

In [120]:
df.season.value_counts()

season
4    2734
2    2733
3    2733
1    2686
Name: count, dtype: int64

In [121]:
pd.crosstab(df.season, df.holiday)

holiday     0   1
season
1        2615  71
2        2685  48
3        2637  96
4        2638  96

# 고급 집계 및 그룹, 반복함수

In [122]:
pd.pivot_table(df, index='season', columns='holiday', values='temp', aggfunc='mean')

holiday          0          1
season
1        12.634585   8.696620
2        22.824402  22.772083
3        28.756284  29.690833
4        16.597384  18.074167

In [ ]:
# 그룹으로 묶어서 처리하기

# df.groupby([열이름, 열이름])[[분석용 열 선택]].집계함수
# df.groupby([열이름, 열이름])[[분석용 열 선택]].agg({'열이름':'함수명','열이름':'함수명'})

In [123]:
df_gr=df.groupby(['season', 'holiday'])

In [124]:
df_gr

In [126]:
# df_gr.groups # 그룹별 특징 확인

In [127]:
df_gr.get_group((1,0))

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count,datetime2
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0000,3,13,16,2011-01-01 00:00:00
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0000,8,32,40,2011-01-01 01:00:00
2,2011-01-01 02:00:00,1,0,0,1,9.02,13.635,80,0.0000,5,27,32,2011-01-01 02:00:00
3,2011-01-01 03:00:00,1,0,0,1,9.84,14.395,75,0.0000,3,10,13,2011-01-01 03:00:00
4,2011-01-01 04:00:00,1,0,0,1,9.84,14.395,75,0.0000,0,1,1,2011-01-01 04:00:00
...,...,...,...,...,...,...,...,...,...,...,...,...,...
6780,2012-03-19 19:00:00,1,0,1,1,25.42,30.305,61,15.0013,86,463,549,2012-03-19 19:00:00
6781,2012-03-19 20:00:00,1,0,1,1,24.60,30.305,64,15.0013,34,296,330,2012-03-19 20:00:00
6782,2012-03-19 21:00:00,1,0,1,1,24.60,30.305,64,11.0014,33,190,223,2012-03-19 21:00:00
6783,2012-03-19 22:00:00,1,0,1,2,22.96,26.515,73,11.0014,17,131,148,2012-03-19 22:00:00
6784,2012-03-19 23:00:00,1,0,1,2,22.96,26.515,78,8.9981,9,45,54,2012-03-19 23:00:00

In [128]:
df.groupby(['season', 'holiday'])[['temp', 'count']].mean()

                     temp       count
season holiday
1      0        12.634585  117.494837
       1         8.696620   73.929577
2      0        22.824402  215.562756
       1        22.772083  197.833333
3      0        28.756284  234.293136
       1        29.690833  237.822917
4      0        16.597384  198.560273
       1        18.074167  210.750000

In [130]:
df_agg=df.groupby(['season', 'holiday'])[['temp', 'count']].agg({'temp':'mean','count':'max'})
df_agg

                     temp  count
season holiday
1      0        12.634585    801
       1         8.696620    228
2      0        22.824402    873
       1        22.772083    712
3      0        28.756284    977
       1        29.690833    584
4      0        16.597384    948
       1        18.074167    596

In [ ]:
# df_gr.agg(

In [131]:
df_agg.droplevel(0)  # 인덱스 수준 선정해서 제거

              temp  count
holiday
0        12.634585    801
1         8.696620    228
0        22.824402    873
1        22.772083    712
0        28.756284    977
1        29.690833    584
0        16.597384    948
1        18.074167    596

In [132]:
    df_agg.index

MultiIndex([(1, 0),
            (1, 1),
            (2, 0),
            (2, 1),
            (3, 0),
            (3, 1),
            (4, 0),
            (4, 1)],
           names=['season', 'holiday'])

In [133]:
df_agg.reset_index(drop=False)

   season  holiday       temp  count
0       1        0  12.634585    801
1       1        1   8.696620    228
2       2        0  22.824402    873
3       2        1  22.772083    712
4       3        0  28.756284    977
5       3        1  29.690833    584
6       4        0  16.597384    948
7       4        1  18.074167    596

In [135]:
# apply : 반복적으로 넘겨주는 데이터별로(열/행, 그룹, 셀 등) 함수를 반복 적용 
# lambda 구문 : lambda 변수: 함수(변수.method() ))
df_iris=pd.read_csv('./data/iris_missing.csv')
df_iris.head(3)

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          NaN           NaN          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa

In [137]:
df_iris.iloc[:,:-1].apply(len)

Sepal.Length    150
Sepal.Width     150
Petal.Length    150
Petal.Width     150
dtype: int64

In [138]:
df_iris.iloc[:,:-1].apply(lambda x: x.mean())  # method 활용하고자 할 경우 조회할 수 있도록 lambda 구문 활용

Sepal.Length    5.853846
Sepal.Width     3.070073
Petal.Length    3.811765
Petal.Width     1.190972
dtype: float64

In [139]:
# 그룹별로 그룹의 평균을 결측치에 반영

df_iris.groupby('Species').mean()

            Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
Species
setosa          5.029787     3.444444      1.465116     0.244898
versicolor      5.932653     2.795745      4.247917     1.329167
virginica       6.595745     2.982222      5.588889     2.036170

In [147]:
df_iris_fillna=df_iris.groupby('Species').apply(lambda x: x.fillna(x.mean())).droplevel(0)
df_iris_fillna.head(2)

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
0           5.1     3.444444      1.465116          0.2
1           4.9     3.000000      1.400000          0.2

In [148]:
df_iris_fillna[df_iris['Sepal.Width'].isna()].head(3)

    Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
0       5.100000     3.444444      1.465116     0.200000
6       5.029787     3.444444      1.465116     0.244898
12      4.800000     3.444444      1.400000     0.100000

In [ ]:
# 데이터 결합
pd.concat([df1, df2, df3,...], axis=0) # 인덱스/열이름을 기준으로 무조건 좌우, 위아래 결합, 인덱스 통일 작업을 선행한 후에 진행
pd.merge(df1, df2, on='동일 변수명', how='left')

In [ ]:
# 타입 변환 시 주의점
# np.nan : 실수형이기 때문에 정수형 변환이 변환 시 에러 발생 
# .astype('int') : 에러 발생
# .add_prefix('x_')
# .add_suffix('x')
# .explode() --> 풀어서 개별 셀에 배당

In [150]:
df_e=pd.read_csv('./data/elec_load_2017_7d.csv')
df_e.head(3)

,YEAR,MONTH,DAY,X1HR,X2HR,X3HR,X4HR,X5HR,X6HR,X7HR,...,X15HR,X16HR,X17HR,X18HR,X19HR,X20HR,X21HR,X22HR,X23HR,X24HR
0,2017,1,1,60178,57862,56165,55135,54450,54401,54147,...,49213,49357,50362,53115,55205,55437,55348,55790,58195,59330
1,2017,1,2,57067,55148,53983,53571,54027,55388,57753,...,72228,71945,72641,73387,72294,69989,67893,66504,67435,69275
2,2017,1,3,66263,64233,63194,62461,62649,63396,65098,...,75576,75168,75791,75922,75469,73118,70769,68726,69593,71346

In [151]:
df_e.columns

Index(['YEAR', 'MONTH', 'DAY', 'X1HR', 'X2HR', 'X3HR', 'X4HR', 'X5HR', 'X6HR',
       'X7HR', 'X8HR', 'X9HR', 'X10HR', 'X11HR', 'X12HR', 'X13HR', 'X14HR',
       'X15HR', 'X16HR', 'X17HR', 'X18HR', 'X19HR', 'X20HR', 'X21HR', 'X22HR',
       'X23HR', 'X24HR'],
      dtype='object')

In [157]:
#df_e.melt(id_vars=df_e.columns[:3])

In [156]:
df_melt=df_e.melt(id_vars=df_e.columns[:3])
df_melt.head(2)

   YEAR  MONTH  DAY variable  value
0  2017      1    1     X1HR  60178
1  2017      1    2     X1HR  57067

In [163]:
# df_melt.variable.str.replace('[0-9]', '', regex=True)
df_melt.variable.str.replace('[A-Z]', '', regex=True)
df_melt.variable.str.replace('[A-Z0-9]', '', regex=True)
df_melt.variable.str.replace('[^0-9]', '', regex=True)
df_melt.variable.str.replace('X[0-9]+', '', regex=True)

0      HR
1      HR
2      HR
3      HR
4      HR
       ..
163    HR
164    HR
165    HR
166    HR
167    HR
Name: variable, Length: 168, dtype: object